import Card from "../../../Card/Card";
import Image from "../../../../Assets/3424974.jpg";
import { Props } from "../../../Card/Card";
import { Grid } from "@material-ui/core";
const CardsList: Props[] = [
  {
    cardDate: "1400/1/1",
    cardImage: Image,
    cardText:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.",
    cardTitle: "Title",
    link: "/Post/1",
    logo: Image,
    imageTitle: "title",
  },
  {
    cardDate: "1400/1/1",
    cardImage: Image,
    cardText:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.",
    cardTitle: "Title",
    link: "/Post/1",
    logo: Image,
    imageTitle: "title",
  },
  {
    cardDate: "1400/1/1",
    cardImage: Image,
    cardText:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.",
    cardTitle: "Title",
    link: "/Post/1",
    imageTitle: "title",
    logo: Image,
  },
  {
    cardDate: "1400/1/1",
    cardImage: Image,
    cardText:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.",
    cardTitle: "Title",
    link: "/Post/1",
    logo: Image,
    imageTitle: "title",
  },
  {
    cardDate: "1400/1/1",
    cardImage: Image,
    cardText:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.",
    cardTitle: "Title",
    link: "/Post/1",
    logo: Image,
    imageTitle: "title",
  },
  {
    cardDate: "1400/1/1",
    cardImage: Image,
    cardText:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.",
    cardTitle: "Title",
    link: "/Post/1",
    logo: Image,
    imageTitle: "title",
  },
];
const CardList = () => {
  return (
    <>
      {CardsList.map((c: Props, idx: number) => (
        <Grid item xl={4} lg={4} md={4} sm={6} xs={12} key={idx}>
          <Card {...c} />
        </Grid>
      ))}
    </>
  );
};

export default CardList;
